app/controllers/friends_controller.rb

  def create
    # @friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twtitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "twtitter" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["twtitter", "@tiwa"], ["updated_at", "2023-09-30 23:41:45.372385"], ["id", 4]]